{
    "collections": [
        {
            "name": "at-tamkin-al-iqtissadi-arabic",
            "language": "ar",
            "description": ""
        }, 
        {
            "name": "islamic-finance-contracts-use-cases", 
            "language": "ar", 
            "description": "Islamic finance contracts on some real use cases on the different financial standards, to be used to retrieve contract templates and previous use cases"  
            
        },
        {
            "name": "islamic-finance-products-implementation-guide", 
            "language": "ar",
            "description": "A guide on how to design and implement new Islamic finance products, including the different financial standards and their use cases, while adhering to shariah standards"
        },
        {
            "name": "shariaa-standards",
            "language": "en",
            "description": "The main Shariaah Standards book for Islamic Finance specified from the AAOIFI as of 2017, to be checked regularly for shariah compliance check"},   
        
        {
            "name": "ijarah-fas-32",
            "language": "en",
            "description": "FAS 32 - Detailed technical specification of Ijarah and Ijarah Muntahia Bittamleek"
        }, 
        {
            "name": "musharaka-fas-4", 
            "language": "en",
            "description": "FAS 4 - Detailed technical specification of Musharaka"
        }, 
        {
            "name":"istisnaa-parallel-istisnaa-fas-10", 
            "language": "en",
            "description": "FAS 10 - Detailed technical specification of Istisnaa and Parallel Istisnaa"
        }, 
        {
            "name": "salam-parallel-salam-fas-7",
            "language": "en",
            "description": "FAS 7 - Detailed technical specification of Salam and Parallel Salam"
        }, 
        {
            "name":"murabaha-deferred-payment-sales-fas-28",
            "language": "en",
            "description": "FAS 28 - Detailed technical specification of Murabaha and other Deferred Payment Sales"
        }, 
        {
            "name":"fiqh-bouyoua-book", 
            "language": "ar",
            "description": "Islamic rules for financial practices"
        }

        ]
    ,
    "fas_standards": [
    {
        "name": "Ijarah",
        "code": "FAS-32",
        "description": "Guidelines for lease-based contracts where the bank leases an asset to a client for a fixed rent, while maintaining asset ownership."
    },
    {
        "name": "Musharaka",
        "code": "FAS-4",
        "description": "Standards for joint venture contracts where partners contribute capital and share profits and losses according to agreed ratios."
    },
    {
        "name": "Istisnaa",
        "code": "FAS-10",
        "description": "Rules for manufacturing or construction contracts where payment and delivery are deferred and agreed in advance."
    },
    {
        "name": "Salam",
        "code": "FAS-7",
        "description": "Regulations for advance payment contracts where the buyer pays upfront for goods delivered at a future date."
    },
    {
        "name": "Murabaha",
        "code": "FAS-28",
        "description": "Guidance on cost-plus sale contracts where the bank buys goods and sells them to the client at a markup, disclosing all costs."
    }
    ]
}
